Revit 2026 API

# FamilyManagerRenameParameter Method

---

Rename a family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RenameParameter(
	FamilyParameter familyParameter,
	string name
)
```
```vb
Public Sub RenameParameter (
	familyParameter As FamilyParameter,
	name As String
)
```
```cpp
public:
void RenameParameter(
	FamilyParameter^ familyParameter,
	String^ name
)
```
```fsharp
member RenameParameter :
        familyParameter : FamilyParameter *
        name : string -> unit
```

#### Parameters

familyParameter FamilyParameter
    The family parameter.
name String
    The new name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter" or "name"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is invalid, or the input name string contains illegal characters, or duplicated with existing parameter name. |
| InvalidOperationException | Thrown when trying to rename a built-in parameter or shared parameter. |

This operation is valid only for Family Parameters, and is invalid for Shared Parameters and Built-in Parameters.

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace